<?php

/* @var $this yii\web\View */
/* @var $model Material */

use app\models\Material;

$this->title = strip_tags($model->getName());

$baseUrl = $this->theme->baseUrl;
?>
<div class="text-page row">
    <div class="col-lg-4 col-md-4 col-sm-4 col-xs-12 title-box">
        <h3><b><?= $model->getName() ?></b>
            <small><?= $model->getDescriptionStr() ?></small>
        </h3>
        <small>أخبار متعلقة بالتعاون والتقدم في مشروع مسجد كربلاء وشفافية مساهماتكم</small>
    </div>
    <div class="col-lg-8 col-md-8 col-sm-8 col-xs-12">
        <ul class="nav nav-tabs">
            <li class="active"><a data-toggle="tab" href="#text-1">كتلة الاسمنت</a></li>
            <li><a data-toggle="tab" href="#text-2">شعاع الحديد</a></li>
            <li><a data-toggle="tab" href="#text-2">طوب الفرن</a></li>
            <li><a data-toggle="tab" href="#text-2">نوافذ زجاجيو مزدوجة</a></li>
            <li><a data-toggle="tab" href="#text-2">الكابلات و الاسلاك</a></li>
        </ul>
        <div class="tab-content">
            <div id="text-1" class="tab-pane fade in active">
                <div class="text">
                    <img src="uploads/1.jpg">
                    <p>ثم هداه صدق الله العظيم. فلما لاح له من ذلك، أن الروح الحيواني بنوع واحد، وان عرض له
                        التكثر بوجه ما، فكان يرى النوع بهذا النظر على ان حقيقة الروح الحيواني، وأن سائر
                        الأشياء التي وردت في شريعته من أمر الله عز وجل من كل ما يوصف بها دونه. وتتبع صفات
                        النقص كلها فرآه بريئاً منها، ومنزهاً عنها؛ وكيف لا يكون منه إلا بفعل يشبه أفعال سائر
                        الحيوان. فاتجهت عنده الأعمال التي يجب عليه من حيث هو جسم، دون أن تقترن به وصف من
                        الأوصاف، التي هي أقل الأجسام حملاً للأوصاف فلم يرها تعرى عن أحد هذين البيتين. ثم
                        قال: أما هذا البيت على ما أودعه هذه الاوراق فان المجال ضيق، والتحكم بالألفاظ على آمر
                        ليس من شأنه أن يلفظ به خطر. فأقول: انه لما فني عن ذاتهوعن جميع وعن جميع ما يتبع هذا
                        الوصف من صفات الأجسام، وتلك الذوات المفارقة بصيغة الجمع حسب لفظنا هذا، أوهم ذلك معنى
                        الاتحاد، وهو مستحيل عليها. وكأني بمن يقف على حقيقة.
                        <br>
                        ثم هداه صدق الله العظيم. فلما لاح له من ذلك، أن الروح الحيواني بنوع واحد، وان عرض له
                        التكثر بوجه ما، فكان يرى النوع بهذا النظر على ان حقيقة الروح الحيواني، وأن سائر
                        الأشياء التي وردت في شريعته من أمر الله عز وجل من كل ما يوصف بها دونه. وتتبع صفات
                        النقص كلها فرآه بريئاً منها، ومنزهاً عنها؛ وكيف لا يكون منه إلا بفعل يشبه أفعال سائر
                        الحيوان. فاتجهت عنده الأعمال التي يجب عليه من حيث هو جسم، دون أن تقترن به وصف من
                        الأوصاف، التي هي أقل الأجسام حملاً للأوصاف فلم يرها تعرى عن أحد هذين البيتين. ثم
                        قال: أما هذا البيت على ما أودعه هذه الاوراق فان المجال ضيق، والتحكم بالألفاظ على آمر
                        ليس من شأنه أن يلفظ به خطر. فأقول: انه لما فني عن ذاتهوعن جميع وعن جميع ما يتبع هذا
                        الوصف من صفات الأجسام، وتلك الذوات المفارقة بصيغة الجمع حسب لفظنا هذا، أوهم ذلك معنى
                        الاتحاد، وهو مستحيل عليها. وكأني بمن يقف على حقيقة.ثم هداه صدق الله العظيم. فلما لاح
                        له من ذلك، أن الروح الحيواني بنوع واحد، وان عرض له التكثر بوجه ما، فكان يرى النوع
                        بهذا النظر على ان حقيقة الروح الحيواني، وأن سائر الأشياء التي وردت في شريعته من أمر
                        الله عز وجل من كل ما يوصف بها دونه. وتتبع صفات النقص كلها فرآه بريئاً منها، ومنزهاً
                        عنها؛ وكيف لا يكون منه إلا بفعل يشبه أفعال سائر الحيوان. فاتجهت عنده الأعمال التي
                        يجب عليه من حيث هو جسم، دون أن تقترن به وصف من الأوصاف، التي هي أقل الأجسام حملاً
                        للأوصاف فلم يرها تعرى عن أحد هذين البيتين. ثم قال: أما هذا البيت على ما أودعه هذه
                        الاوراق فان المجال ضيق، والتحكم بالألفاظ على آمر ليس من شأنه أن يلفظ به خطر. فأقول:
                        انه لما فني عن ذاتهوعن جميع وعن جميع ما يتبع هذا الوصف من صفات الأجسام، وتلك الذوات
                        المفارقة بصيغة الجمع حسب لفظنا هذا، أوهم ذلك معنى الاتحاد، وهو مستحيل عليها. وكأني
                        بمن يقف على حقيقة.</p>
                </div>
                <div class="page-image-gallery">
                    <ul>
                        <li><a href="#"><img src="uploads/masjed.jpg"></a></li>
                        <li><a href="#"><img src="uploads/masjed.jpg"></a></li>
                        <li><a href="#"><img src="uploads/masjed.jpg"></a></li>
                        <li><a href="#"><img src="uploads/masjed.jpg"></a></li>
                        <li><a href="#"><img src="uploads/masjed.jpg"></a></li>
                        <li><a href="#"><img src="uploads/masjed.jpg"></a></li>
                    </ul>
                </div>
            </div>
            <div id="text-2" class="tab-pane fade">
                <div class="text">
                    <img src="uploads/1.jpg">
                    <p>ثم هداه صدق الله العظيم. فلما لاح له من ذلك، أن الروح الحيواني بنوع واحد، وان عرض له
                        التكثر بوجه ما، فكان يرى النوع بهذا النظر على ان حقيقة الروح الحيواني، وأن سائر
                        الأشياء التي وردت في شريعته من أمر الله عز وجل من كل ما يوصف بها دونه. وتتبع صفات
                        النقص كلها فرآه بريئاً منها، ومنزهاً عنها؛ وكيف لا يكون منه إلا بفعل يشبه أفعال سائر
                        الحيوان. فاتجهت عنده الأعمال التي يجب عليه من حيث هو جسم، دون أن تقترن به وصف من
                        الأوصاف، التي هي أقل الأجسام حملاً للأوصاف فلم يرها تعرى عن أحد هذين البيتين. ثم
                        قال: أما هذا البيت على ما أودعه هذه الاوراق فان المجال ضيق، والتحكم بالألفاظ على آمر
                        ليس من شأنه أن يلفظ به خطر. فأقول: انه لما فني عن ذاتهوعن جميع وعن جميع ما يتبع هذا
                        الوصف من صفات الأجسام، وتلك الذوات المفارقة بصيغة الجمع حسب لفظنا هذا، أوهم ذلك معنى
                        الاتحاد، وهو مستحيل عليها. وكأني بمن يقف على حقيقة.
                        <br>
                        ثم هداه صدق الله العظيم. فلما لاح له من ذلك، أن الروح الحيواني بنوع واحد، وان عرض له
                        التكثر بوجه ما، فكان يرى النوع بهذا النظر على ان حقيقة الروح الحيواني، وأن سائر
                        الأشياء التي وردت في شريعته من أمر الله عز وجل من كل ما يوصف بها دونه. وتتبع صفات
                        النقص كلها فرآه بريئاً منها، ومنزهاً عنها؛ وكيف لا يكون منه إلا بفعل يشبه أفعال سائر
                        الحيوان. فاتجهت عنده الأعمال التي يجب عليه من حيث هو جسم، دون أن تقترن به وصف من
                        الأوصاف، التي هي أقل الأجسام حملاً للأوصاف فلم يرها تعرى عن أحد هذين البيتين. ثم
                        قال: أما هذا البيت على ما أودعه هذه الاوراق فان المجال ضيق، والتحكم بالألفاظ على آمر
                        ليس من شأنه أن يلفظ به خطر. فأقول: انه لما فني عن ذاتهوعن جميع وعن جميع ما يتبع هذا
                        الوصف من صفات الأجسام، وتلك الذوات المفارقة بصيغة الجمع حسب لفظنا هذا، أوهم ذلك معنى
                        الاتحاد، وهو مستحيل عليها. وكأني بمن يقف على حقيقة.ثم هداه صدق الله العظيم. فلما لاح
                        له من ذلك، أن الروح الحيواني بنوع واحد، وان عرض له التكثر بوجه ما، فكان يرى النوع
                        بهذا النظر على ان حقيقة الروح الحيواني، وأن سائر الأشياء التي وردت في شريعته من أمر
                        الله عز وجل من كل ما يوصف بها دونه. وتتبع صفات النقص كلها فرآه بريئاً منها، ومنزهاً
                        عنها؛ وكيف لا يكون منه إلا بفعل يشبه أفعال سائر الحيوان. فاتجهت عنده الأعمال التي
                        يجب عليه من حيث هو جسم، دون أن تقترن به وصف من الأوصاف، التي هي أقل الأجسام حملاً
                        للأوصاف فلم يرها تعرى عن أحد هذين البيتين. ثم قال: أما هذا البيت على ما أودعه هذه
                        الاوراق فان المجال ضيق، والتحكم بالألفاظ على آمر ليس من شأنه أن يلفظ به خطر. فأقول:
                        انه لما فني عن ذاتهوعن جميع وعن جميع ما يتبع هذا الوصف من صفات الأجسام، وتلك الذوات
                        المفارقة بصيغة الجمع حسب لفظنا هذا، أوهم ذلك معنى الاتحاد، وهو مستحيل عليها. وكأني
                        بمن يقف على حقيقة.</p>
                </div>
                <div class="page-image-gallery">
                    <ul>
                        <li><a href="#"><img src="uploads/masjed.jpg"></a></li>
                        <li><a href="#"><img src="uploads/masjed.jpg"></a></li>
                        <li><a href="#"><img src="uploads/masjed.jpg"></a></li>
                        <li><a href="#"><img src="uploads/masjed.jpg"></a></li>
                        <li><a href="#"><img src="uploads/masjed.jpg"></a></li>
                        <li><a href="#"><img src="uploads/masjed.jpg"></a></li>
                    </ul>
                </div>
            </div>
        </div>
    </div>
</div>
